---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsJustificationParam
source: html/dfcdb8ef-34ca-ab49-3bfc-f8d91449c78c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsJustificationParam Property

"Justification"

## Syntax (C#)
```csharp
public static ForgeTypeId HandrailSupportsJustificationParam { get; }
```